In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a', 'b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10, 'b':20, 'c':30}

In [4]:
my_data

[10, 20, 30]

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
ser1=pd.Series([1,2,3,4],['US', 'Canada', 'India', 'UK'])

#

In [13]:
ser1

US        1
Canada    2
India     3
UK        4
dtype: int64

In [15]:
from numpy.random import randn

In [17]:
np.random.seed(1)
df=pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'],['F', 'G', 'H', 'I'])
df

          F         G         H         I
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [18]:
df.F

A    1.624345
B    0.865408
C    0.319039
D   -0.322417
E   -0.172428
Name: F, dtype: float64

In [20]:
df[['F','G']]

          F         G
A  1.624345 -0.611756
B  0.865408 -2.301539
C  0.319039 -0.249370
D -0.322417 -0.384054
E -0.172428 -0.877858

In [21]:
df['J']=df['F']+df['G']

In [22]:
df

          F         G         H         I         J
A  1.624345 -0.611756 -0.528172 -1.072969  1.012589
B  0.865408 -2.301539  1.744812 -0.761207 -1.436131
C  0.319039 -0.249370  1.462108 -2.060141  0.069669
D -0.322417 -0.384054  1.133769 -1.099891 -0.706472
E -0.172428 -0.877858  0.042214  0.582815 -1.050287

In [23]:
df.drop('J',axis=1,inplace=True)

In [24]:
df

          F         G         H         I
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [25]:
df.drop('E',axis=0)

          F         G         H         I
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891

In [26]:
df.loc['A']

F    1.624345
G   -0.611756
H   -0.528172
I   -1.072969
Name: A, dtype: float64

In [27]:
df.iloc[2]

F    0.319039
G   -0.249370
H    1.462108
I   -2.060141
Name: C, dtype: float64

In [28]:
df[(df['F']>0) & (df['H']>0)]

          F         G         H         I
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141

In [29]:
df.reset_index()

  index         F         G         H         I
0     A  1.624345 -0.611756 -0.528172 -1.072969
1     B  0.865408 -2.301539  1.744812 -0.761207
2     C  0.319039 -0.249370  1.462108 -2.060141
3     D -0.322417 -0.384054  1.133769 -1.099891
4     E -0.172428 -0.877858  0.042214  0.582815

In [30]:
newind='CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [31]:
df['States']=newind

In [32]:
df

          F         G         H         I States
A  1.624345 -0.611756 -0.528172 -1.072969     CA
B  0.865408 -2.301539  1.744812 -0.761207     NY
C  0.319039 -0.249370  1.462108 -2.060141     WY
D -0.322417 -0.384054  1.133769 -1.099891     OR
E -0.172428 -0.877858  0.042214  0.582815     CO

In [34]:
df.set_index('States') #inplace=True for saving in df

               F         G         H         I
States
CA      1.624345 -0.611756 -0.528172 -1.072969
NY      0.865408 -2.301539  1.744812 -0.761207
WY      0.319039 -0.249370  1.462108 -2.060141
OR     -0.322417 -0.384054  1.133769 -1.099891
CO     -0.172428 -0.877858  0.042214  0.582815

MISSING VALUES

In [35]:
d={'A': [1,2,np.nan], 'B': [3,np.nan, np.nan], 'C':[1,2,3]}

In [38]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
df.dropna()

     A    B  C
0  1.0  3.0  1

In [40]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [42]:
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2

In [43]:
df.fillna(value=0)

     A    B  C
0  1.0  3.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [44]:
df['A'].fillna(value=df['A'].mean()) #.sum(), .std() , .count()

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [45]:
#df.groupby('Company').describe() - gives all stats

In [46]:
#pd.concat([df1,df2,df3]) #specify axis =1 for column

In [48]:
#pd.merge(left,right,how='inner', on='key') # how=inner, outer,right,left #on=['key1', 'key2']

In [49]:
#left.join(right, how='')

In [50]:
df['A'].unique()

array([ 1.,  2., nan])

In [51]:
len(df['A'].unique())

3

In [52]:
df['A'].nunique()

2

In [53]:
df.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [54]:
df['A'].value_counts()

2.0    1
1.0    1
Name: A, dtype: int64

In [55]:
def times2(x):
    return x*2

In [56]:
times2(4)

8

In [57]:
df['A'].sum()

3.0

In [58]:
df['A'].apply(times2)

0    2.0
1    4.0
2    NaN
Name: A, dtype: float64

In [59]:
df['A'].apply(lambda x:x*2)

0    2.0
1    4.0
2    NaN
Name: A, dtype: float64

In [63]:
df.sort_values(by='C')

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3